/************************************************************
 * 版权：2025CIMC Copyright。
 * 文件：can.h
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2026/4/16     V0.01    original
************************************************************/
#ifndef __CAN_H__
#define __CAN_H__

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/

void my_can_init(void);

void my_can_send_message(void);

void my_can_receive_message(void);

void my_can_deinit(void);

#endif // !__CAN_H__

/****************************End*****************************/

