/************************************************************
 * 版权：2025CIMC Copyright。
 * 文件：timer.h
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2026/2/10     V0.01    original
************************************************************/
#ifndef __TIMER_H__
#define __TIMER_H__

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/
void my_timer_init(void);

void my_timer_pwm_config(uint8_t pulse_value_Percentage);

#endif // !__TIMER_H__

/****************************End*****************************/
