/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：Function.h
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2026/2/5     V0.01    original
************************************************************/

#ifndef __EXTRTC_H
#define __EXTRTC_H

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/

void my_extRTC_init(void);

void my_extRTC_ReadTime(uint8_t addr , uint8_t* data , uint8_t len);

void my_extRTC_Test(void);

#endif


/****************************End*****************************/
